In [3]:
#Вычисления с помощью Numpy
#1
import numpy as np
a = np.array ([[1, 6],
             [2, 8],
             [3, 11],
             [3, 10],
             [1, 7]])
mean_a= a.mean(axis=0)
print (mean_a)

[2.  8.4]

In [4]:
#2
a_centered = a - mean_a
print (a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

In [11]:
#3
a_centered_sp = a_centered[0:, 0] @ a_centered [0:, 1]
print (a_centered_sp)
a_centered_sp/5

8.0

1.6

In [15]:
#Работа с данными в Pandas
#1
import pandas as pd

authors = pd.DataFrame({'author_id':[1, 2, 3],
                 'author_name' : ['Тургенев', 'Чехов', 'Островский']})
                    
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [16]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],
                 'book_title' : ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 
                                 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 
                                 'Таланты и поклонники'],
                'price': [450, 300, 350, 500, 450, 370, 290]})

book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [18]:
#2
authors_price =pd.merge (authors, book, on= 'author_id', how = 'outer')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [22]:
#3
top5=authors_price.nlargest (5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [ ]:
#4
authors_stat=